//══════════════════════════════════════════════════════════════════════════════════════════════════════// 
//                                                                                                      //
//                                   MULTI-DEVICE WHATSAPP BOT                                          //
//                                                                                                      //
//                                            𝚅.𝟷.4.9                                                   // 
//                                                                                                      //
//              ███████╗██╗ ██████╗ ███╗   ███╗ █████╗     ███╗   ███╗██████╗                           //
//              ██╔════╝██║██╔════╝ ████╗ ████║██╔══██╗    ████╗ ████║██╔══██╗                          //
//              ███████╗██║██║  ███╗██╔████╔██║███████║    ██╔████╔██║██║  ██║                          //
//              ╚════██║██║██║   ██║██║╚██╔╝██║██╔══██║    ██║╚██╔╝██║██║  ██║                          //
//              ███████║██║╚██████╔╝██║ ╚═╝ ██║██║  ██║    ██║ ╚═╝ ██║██████╔╝                          //
//              ╚══════╝╚═╝ ╚═════╝ ╚═╝     ╚═╝╚═╝  ╚═╝    ╚═╝     ╚═╝╚═════╝                           //
//                                                                                                      //
//                                          BY:MAHER-ZUBAIR                                             //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

/**

* @project_name : SIGMA-MD
* @Developer : Maher-Zubair
* @Version : v.1.4.9
* @license : Apache-2.0

This Project Is Under Apache-2.0 License.
So, No One Have Permission To Copy This Project,
Reupload, Reversed Engineering And Any Kind Of Deobfuscation.
Otherwise, A Legal Github Copyright Action Will Be Taken Against You
Which Result In Removing The Copied Project And Permanantly Banning Of You Account.
* @Copyright_owner : Maher-Zubair

**/

var _0xe92c=["\x74\x61\x78","\x63\x68\x61\x74","\x73\x65\x6E\x64\x4D\x65\x73\x73\x61\x67\x65","\x69\x6D\x61\x67\x65","\x76\x69\x64\x65\x6F","\x61\x75\x64\x69\x6F","\x65\x78\x70\x6F\x72\x74\x73"];async function Maher_Zubair(_0x1bb8x2,_0x1bb8x3,_0x1bb8x4,_0x1bb8x5= _0xe92c[0]){let _0x1bb8x6=_0x1bb8x3[_0xe92c[1]];try{if(_0x1bb8x5== _0xe92c[0]){return  await _0x1bb8x2[_0xe92c[2]](_0x1bb8x6,{tax:_0x1bb8x4},{quoted:_0x1bb8x3})}else {if(_0x1bb8x5== _0xe92c[3]){return  await _0x1bb8x2[_0xe92c[2]](_0x1bb8x6,{image:{url:_0x1bb8x4}},{quoted:_0x1bb8x3})}else {if(_0x1bb8x5== _0xe92c[4]){return  await _0x1bb8x2[_0xe92c[2]](_0x1bb8x6,{video:{url:_0x1bb8x4}},{quoted:_0x1bb8x3})}else {if(_0x1bb8x5== _0xe92c[5]){return  await _0x1bb8x2[_0xe92c[2]](_0x1bb8x6,{audio:{url:_0x1bb8x4}},{quoted:_0x1bb8x3})}}}}}catch{}}module[_0xe92c[6]]= {Maher_Zubair}